[X2Photobooth]
m_arrAnimationPoses[69]=(AnimationDisplayName="SHIELD ByTheBook")
m_arrAnimationPoses[70]=(AnimationDisplayName="SHIELD Bracing")
m_arrAnimationPoses[71]=(AnimationDisplayName="SHIELD Guardian")
m_arrAnimationPoses[72]=(AnimationDisplayName="SHIELD Intimidate")
m_arrAnimationPoses[73]=(AnimationDisplayName="SHIELD Resting")
m_arrAnimationPoses[74]=(AnimationDisplayName="SHIELD Gun Down")
m_arrAnimationPoses[75]=(AnimationDisplayName="SHIELD Wall")
m_arrAnimationPoses[76]=(AnimationDisplayName="SHIELD Gun Up")
m_arrAnimationPoses[77]=(AnimationDisplayName="SHIELD Hunkered Fire")
m_arrAnimationPoses[78]=(AnimationDisplayName="SHIELD Sword 1")
m_arrAnimationPoses[79]=(AnimationDisplayName="SHIELD Sword 2")
m_arrAnimationPoses[80]=(AnimationDisplayName="SHIELD Rifle 1")
m_arrAnimationPoses[81]=(AnimationDisplayName="SHIELD Rifle 2")

[BallisticShield_CV X2WeaponTemplate]
FriendlyName="Ballistic Shield MK1"
FriendlyNamePlural="Ballistic Shields MK1"
BriefSummary="One of the oldest forms of additional protection known to mankind, humans have been using some form of shield since the very earliest days of tool use. This one is a standard anti-ballistic model with metallic or ceramic plates designed to stop penetration from high caliber weaponry."
TacticalText="<Bullet/>One of the oldest forms of additional protection known to mankind, humans have been using some form of shield since the very earliest days of tool use. This one is a standard anti-ballistic model with metallic or ceramic plates designed to stop penetration from high caliber weaponry."

[BallisticShield_MG X2WeaponTemplate]
FriendlyName="Ballistic Shield MK2"
FriendlyNamePlural="Ballistic Shields MK2"
BriefSummary="The use of alien alloys has not only made the Ballistic Shield light, but stronger as well. Complex polymers and ceramics also allow for better heat distribution, as such users are less likely to be injured by shrapnel and molten material from their own protective measures. An optional LED tablet can be installed to aid in tactical planning."
TacticalText="<Bullet/>The use of alien alloys has not only made the Ballistic Shield light, but stronger as well. Complex polymers and ceramics also allow for better heat distribution, as such users are less likely to be injured by shrapnel and molten material from their own protective measures. An optional LED tablet can be installed to aid in tactical planning."

[BallisticShield_BM X2WeaponTemplate]
FriendlyName="Ballistic Shield MK3"
FriendlyNamePlural="Ballistic Shields MK3"
BriefSummary="Advances in miniaturization allow this shield to pack not only conventional material defences but more esoteric means like energy shields as well. Nanomaterials allow for it to self repair in the field and it can even serve as a charging port during emergencies. An integrated holographic system allows for greater situational awareness."
TacticalText="<Bullet/>Advances in miniaturization allow this shield to pack not only conventional material defences but more esoteric means like energy shields as well. Nanomaterials allow for it to self repair in the field and it can even serve as a charging port during emergencies. An integrated holographic system allows for greater situational awareness."

[BallisticShield_CV X2AbilityTemplate]
LocFriendlyName="Ballistic Shield"
LocHelpText="Grants 6 shield points and half cover to alllies."
LocLongDescription="Grants 6 shield points and half cover to alllies."
LocFlyOverText="Ballistic Shield"

[BallisticShield_MG X2AbilityTemplate]
LocFriendlyName="Ballistic Shield"
LocHelpText="Grants 10 shield points and half cover to alllies."
LocLongDescription="Grants 10 shield points and half cover to alllies."
LocFlyOverText="Ballistic Shield"

[BallisticShield_BM X2AbilityTemplate]
LocFriendlyName="Ballistic Shield"
LocHelpText="Grants 14 shield points and half cover to alllies."
LocLongDescription="Grants 14 shield points and half cover to alllies."
LocFlyOverText="Ballistic Shield"

[ShieldBash X2AbilityTemplate]
LocFriendlyName="Shield Bash"
LocHelpText="Make a melee attack with your shield."
LocLongDescription="Make a melee attack with your shield that leaves your opponent disoriented."
LocFlyOverText="Shield Bash"

[ShieldWall X2AbilityTemplate]
LocFriendlyName="Shield Wall"
LocHelpText="Provide a mobile shield wall for you allies."
LocLongDescription="Works like hunker down but can be used outside cover and provides full cover for allies. While the shield wall is in effect the soldier has a -20 defense penalty."
LocFlyOverText="Shield Wall"